# **Updating DataFrame Data**

In [26]:
import pandas as pd

In [27]:
data = { 'first': ['mild','mill','isaac'],
        'Last': [ 'me', 'myself', 'andI'],
        'age': [ '19', '24', '44'],
        'CH_count':[20, 27, 60]}
clients = pd.DataFrame(data)
clients

   first    Last age  CH_count
0   mild      me  19        20
1   mill  myself  24        27
2  isaac    andI  44        60

### **Add rows**

In [28]:
new_data = { 'First': ['you','notMe'],
        'Last': [ 'some1', 'butU'],
        'Age': [ '38', '91'],
        'CH_count':[2, 16]}
new_clients = pd.DataFrame(new_data)
new_clients

   First   Last Age  CH_count
0    you  some1  38         2
1  notMe   butU  91        16

# ***Figure out what is going on with append()***

> ## **HOMEWORK**

In [ ]:
clients.append(new_clients)

In [ ]:
# So i went to an A.i. for code assistance to see if the problem and code would be correct.

import pandas as pd

data = {'first': ['mild', 'mill', 'isaac'],
        'Last': ['me', 'myself', 'andI'],
        'age': ['19', '24', '44'],
        'CH_count': [20, 27, 60]}
clients = pd.DataFrame(data)

new_data = {'First': ['you', 'notMe'],
            'Last': ['some1', 'butU'],
            'Age': ['38', '91'],
            'CH_count': [2, 16]}
new_clients = pd.DataFrame(new_data)

result = clients.append(new_clients, ignore_index=True)

## **This was A.I. using concat()**

In [29]:
import pandas as pd

data = {'First': ['mild', 'mill', 'isaac'],
        'Last': ['me', 'myself', 'andI'],
        'Age': ['19', '24', '44'],
        'CH_count': [20, 27, 60]}
clients = pd.DataFrame(data)

new_data = {'First': ['you', 'notMe'],
            'Last': ['some1', 'butU'],
            'Age': ['38', '91'],
            'CH_count': [2, 16]}
new_clients = pd.DataFrame(new_data)

result = pd.concat([clients, new_clients], ignore_index=True)

In [30]:
result

   First    Last Age  CH_count
0   mild      me  19        20
1   mill  myself  24        27
2  isaac    andI  44        60
3    you   some1  38         2
4  notMe    butU  91        16

### **Setting specific value**

In [31]:
clients.loc[2, 'First'] = 'Pothead'
clients

     First    Last Age  CH_count
0     mild      me  19        20
1     mill  myself  24        27
2  Pothead    andI  44        60

In [32]:
clients.loc[0:1, 'CH_count'] -1
clients

     First    Last Age  CH_count
0     mild      me  19        20
1     mill  myself  24        27
2  Pothead    andI  44        60

## **Update using Math operations**

In [34]:
clients.CH_count + 1

0    21
1    28
2    61
Name: CH_count, dtype: int64

In [35]:
clients

     First    Last Age  CH_count
0     mild      me  19        20
1     mill  myself  24        27
2  Pothead    andI  44        60

In [36]:
clients.CH_count -= 3
clients

     First    Last Age  CH_count
0     mild      me  19        17
1     mill  myself  24        24
2  Pothead    andI  44        57

## **Update using replace method**

In [37]:
clients.replace(-4,0)
clients

     First    Last Age  CH_count
0     mild      me  19        17
1     mill  myself  24        24
2  Pothead    andI  44        57

# this is the lab